apache/nuttx/arch/arm/src/tiva/hardware/tm4c/tm4c129_timer.h
#define TIMER_CTL_TAEN                 (1 << 0)  /* Bit 0:  Timer A Enable */
#define TIMER_CTL_TASTALL              (1 << 1)  /* Bit 1:  Timer A Stall Enable */
#define TIMER_CTL_TAEVENT_SHIFT        (2)       /* Bits 2-3: GPTM Timer A Event Mode */
#define TIMER_CTL_TAEVENT_MASK         (3 << TIMER_CTL_TAEVENT_SHIFT)
#  define TIMER_CTL_TAEVENT_POS        (0 << TIMER_CTL_TAEVENT_SHIFT) /* Positive edge */
#  define TIMER_CTL_TAEVENT_NEG        (1 << TIMER_CTL_TAEVENT_SHIFT) /* Negative edge */
#  define TIMER_CTL_TAEVENT_BOTH       (3 << TIMER_CTL_TAEVENT_SHIFT) /* Both edges */
#define TIMER_CTL_RTCEN                (1 << 4)  /* Bit 4:  GPTM RTC Stall Enable */
#define TIMER_CTL_TAOTE                (1 << 5)  /* Bit 5:  GPTM Timer A Output Trigger Enable */
#define TIMER_CTL_TAPWML               (1 << 6)  /* Bit 6:  GPTM Timer A PWM Output Level */
#define TIMER_CTL_TBEN                 (1 << 8)  /* Bit 8:  GPTM Timer B Enable */
#define TIMER_CTL_TBSTALL              (1 << 9)  /* Bit 9:  GPTM Timer B Stall Enable */
#define TIMER_CTL_TBEVENT_SHFIT        (10)      /* Bits 10-11: GPTM Timer B Event Mode */
#define TIMER_CTL_TBEVENT_MASK         (3 << TIMER_CTL_TBEVENT_SHFIT)
#  define TIMER_CTL_TBEVENT_POS        (0 << TIMER_CTL_TBEVENT_SHFIT) /* Positive edge */
#  define TIMER_CTL_TBEVENT_NEG        (1 << TIMER_CTL_TBEVENT_SHFIT) /* Negative edge */
#  define TIMER_CTL_TBEVENT_BOTH       (3 << TIMER_CTL_TBEVENT_SHFIT) /* Both edges */
#define TIMER_CTL_TBOTE                (1 << 13) /* Bit 13: GPTM Timer B Output Trigger Enable */
#define TIMER_CTL_TBPWML               (1 << 14) /* Bit 14: GPTM Timer B PWM Output Level */

/* GPTM Synchronize (GPTM0 only) */

#define TIMER_SYNC_NONE                0         /* GPTMn is not affected */
#define TIMER_SYNC_TA                  1         /* Timer A timeout event triggered */
#define TIMER_SYNC_TB                  2         /* Timer B timeout event triggered */
#define TIMER_SYNC_TATB                3         /* Both  Timer A/B timeout event triggered */

#define TIMER_SYNC_SYNCT_SHIFT(i)      ((i) << 1) /* Synchronize GPTMi timer i */
#define TIMER_SYNC_SYNCT_MASK(i)       (3 << TIMER_SYNC_SYNCT_SHIFT(i))
#  define TIMER_SYNC_SYNCT(i,n)        ((uint32_t)(n) << TIMER_SYNC_SYNCT_SHIFT(i))
#  define TIMER_SYNC_SYNCT_NONE(i)     TIMER_SYNC_SYNCT(i,TIMER_SYNC_NONE)
#  define TIMER_SYNC_SYNCT_TA(i)       TIMER_SYNC_SYNCT(i,TIMER_SYNC_TA)
#  define TIMER_SYNC_SYNCT_TB(i)       TIMER_SYNC_SYNCT(i,TIMER_SYNC_TB)
#  define TIMER_SYNC_SYNCT_TATB(i)     TIMER_SYNC_SYNCT(i,TIMER_SYNC_TATB)

#define TIMER_SYNC_SYNCT0_SHIFT        (0)       /* Bits 0-1: Synchronize GPTM timer 0 */
#define TIMER_SYNC_SYNCT0_MASK         (3 << TIMER_SYNC_SYNCT0_SHIFT)
#  define TIMER_SYNC_SYNCT0(n)         ((uint32_t)(n) << TIMER_SYNC_SYNCT0_SHIFT)
#  define TIMER_SYNC_SYNCT0_NONE       TIMER_SYNC_SYNCT0(TIMER_SYNC_NONE)
#  define TIMER_SYNC_SYNCT0_TA         TIMER_SYNC_SYNCT0(TIMER_SYNC_TA)
#  define TIMER_SYNC_SYNCT0_TB         TIMER_SYNC_SYNCT0(TIMER_SYNC_TB)
#  define TIMER_SYNC_SYNCT0_TATB       TIMER_SYNC_SYNCT0(TIMER_SYNC_TATB)
#define TIMER_SYNC_SYNCT1_SHIFT        (2)       /* Synchronize GPTM timer 1 */
#define TIMER_SYNC_SYNCT1_MASK         (3 << TIMER_SYNC_SYNCT1_SHIFT)
#  define TIMER_SYNC_SYNCT1(n)         ((uint32_t)(n) << TIMER_SYNC_SYNCT1_SHIFT)
#  define TIMER_SYNC_SYNCT1_NONE       TIMER_SYNC_SYNCT1(TIMER_SYNC_NONE)
#  define TIMER_SYNC_SYNCT1_TA         TIMER_SYNC_SYNCT1(TIMER_SYNC_TA)
#  define TIMER_SYNC_SYNCT1_TB         TIMER_SYNC_SYNCT1(TIMER_SYNC_TB)
#  define TIMER_SYNC_SYNCT1_TATB       TIMER_SYNC_SYNCT1(TIMER_SYNC_TATB)
#define TIMER_SYNC_SYNCT2_SHIFT        (4)       /* Synchronize GPTM timer 2 */
#define TIMER_SYNC_SYNCT2_MASK         (3 <<TIMER_SYNC_SYNCT2_SHIFT )
#  define TIMER_SYNC_SYNCT2(n)         ((uint32_t)(n) << TIMER_SYNC_SYNCT2_SHIFT)
#  define TIMER_SYNC_SYNCT2_NONE       TIMER_SYNC_SYNCT2(TIMER_SYNC_NONE)
#  define TIMER_SYNC_SYNCT2_TA         TIMER_SYNC_SYNCT2(TIMER_SYNC_TA)
#  define TIMER_SYNC_SYNCT2_TB         TIMER_SYNC_SYNCT2(TIMER_SYNC_TB)
#  define TIMER_SYNC_SYNCT2_TATB       TIMER_SYNC_SYNCT2(TIMER_SYNC_TATB)
#define TIMER_SYNC_SYNCT3_SHIFT        (6)       /* Synchronize GPTM timer 3 */
#define TIMER_SYNC_SYNCT3_MASK         (3 << TIMER_SYNC_SYNCT3_SHIFT)
#  define TIMER_SYNC_SYNCT3(n)         ((uint32_t)(n) << TIMER_SYNC_SYNCT3_SHIFT)
#  define TIMER_SYNC_SYNCT3_NONE       TIMER_SYNC_SYNCT3(TIMER_SYNC_NONE)
#  define TIMER_SYNC_SYNCT3_TA         TIMER_SYNC_SYNCT3(TIMER_SYNC_TA)
#  define TIMER_SYNC_SYNCT3_TB         TIMER_SYNC_SYNCT3(TIMER_SYNC_TB)
#  define TIMER_SYNC_SYNCT3_TATB       TIMER_SYNC_SYNCT3(TIMER_SYNC_TATB)
#define TIMER_SYNC_SYNCT4_SHIFT        (8)       /* Synchronize GPTM timer 4 */
#define TIMER_SYNC_SYNCT4_MASK         (3 << TIMER_SYNC_SYNCT4_SHIFT)
#  define TIMER_SYNC_SYNCT4(n)         ((uint32_t)(n) << TIMER_SYNC_SYNCT4_SHIFT)
#  define TIMER_SYNC_SYNCT4_NONE       TIMER_SYNC_SYNCT4(TIMER_SYNC_NONE)
#  define TIMER_SYNC_SYNCT4_TA         TIMER_SYNC_SYNCT4(TIMER_SYNC_TA)
#  define TIMER_SYNC_SYNCT4_TB         TIMER_SYNC_SYNCT4(TIMER_SYNC_TB)
#  define TIMER_SYNC_SYNCT4_TATB       TIMER_SYNC_SYNCT4(TIMER_SYNC_TATB)
#define TIMER_SYNC_SYNCT5_SHIFT        (10)      /* Synchronize GPTM timer 5 */
#define TIMER_SYNC_SYNCT5_MASK         (3 << TIMER_SYNC_SYNCT5_SHIFT)
#  define TIMER_SYNC_SYNCT5(n)         ((uint32_t)(n) << TIMER_SYNC_SYNCT5_SHIFT)
#  define TIMER_SYNC_SYNCT5_NONE       TIMER_SYNC_SYNCT5(TIMER_SYNC_NONE)
#  define TIMER_SYNC_SYNCT5_TA         TIMER_SYNC_SYNCT5(TIMER_SYNC_TA)
#  define TIMER_SYNC_SYNCT5_TB         TIMER_SYNC_SYNCT5(TIMER_SYNC_TB)
#  define TIMER_SYNC_SYNCT5_TATB       TIMER_SYNC_SYNCT5(TIMER_SYNC_TATB)
#define TIMER_SYNC_SYNCT6_SHIFT        (12)      /* Synchronize GPTM timer 6 */
#define TIMER_SYNC_SYNCT6_MASK         (3 << TIMER_SYNC_SYNCT6_SHIFT)
#  define TIMER_SYNC_SYNCT6(n)         ((uint32_t)(n) << TIMER_SYNC_SYNCT6_SHIFT)
#  define TIMER_SYNC_SYNCT6_NONE       TIMER_SYNC_SYNCT6(TIMER_SYNC_NONE)
#  define TIMER_SYNC_SYNCT6_TA         TIMER_SYNC_SYNCT6(TIMER_SYNC_TA)
#  define TIMER_SYNC_SYNCT6_TB         TIMER_SYNC_SYNCT6(TIMER_SYNC_TB)
#  define TIMER_SYNC_SYNCT6_TATB       TIMER_SYNC_SYNCT6(TIMER_SYNC_TATB)
#define TIMER_SYNC_SYNCT7_SHIFT        (14)      /* Synchronize GPTM timer 7 */
#define TIMER_SYNC_SYNCT7_MASK         (3 << TIMER_SYNC_SYNCT7_SHIFT)
#  define TIMER_SYNC_SYNCT7(n)         ((uint32_t)(n) << TIMER_SYNC_SYNCT7_SHIFT)
#  define TIMER_SYNC_SYNCT7_NONE       TIMER_SYNC_SYNCT7(TIMER_SYNC_NONE)
#  define TIMER_SYNC_SYNCT7_TA         TIMER_SYNC_SYNCT7(TIMER_SYNC_TA)
#  define TIMER_SYNC_SYNCT7_TB         TIMER_SYNC_SYNCT7(TIMER_SYNC_TB)
#  define TIMER_SYNC_SYNCT7_TATB       TIMER_SYNC_SYNCT7(TIMER_SYNC_TATB)
#define TIMER_SYNC_SYNCWT_SHIFT(i)     ((i) << 1) /* Synchronize GPTMi 32/64-Bit Timer i */
#define TIMER_SYNC_SYNCWT_MASK(i)      (3 << TIMER_SYNC_SYNCT_SHIFT(i))
#  define TIMER_SYNC_SYNCWT(i,n)       ((uint32_t)(n) << TIMER_SYNC_SYNCT_SHIFT(i))
#  define TIMER_SYNC_SYNCWT_NONE(i)    TIMER_SYNC_SYNCT(i,TIMER_SYNC_NONE)
#  define TIMER_SYNC_SYNCWT_TA(i)      TIMER_SYNC_SYNCT(i,TIMER_SYNC_TA)
#  define TIMER_SYNC_SYNCWT_TB(i)      TIMER_SYNC_SYNCT(i,TIMER_SYNC_TB)
#  define TIMER_SYNC_SYNCWT_TATB(i)    TIMER_SYNC_SYNCT(i,TIMER_SYNC_TATB)
#define TIMER_SYNC_SYNCWT0_SHIFT       (12)      /* Synchronize WTM 32/64-Bit wide timer 0 */
#define TIMER_SYNC_SYNCWT0_MASK        (3 << TIMER_SYNC_SYNCWT0_SHIFT)
#  define TIMER_SYNC_SYNCWT0(n)        ((uint32_t)(n) << TIMER_SYNC_SYNCWT0_SHIFT)
#  define TIMER_SYNC_SYNCWT0_NONE      TIMER_SYNC_SYNCWT0(TIMER_SYNC_NONE)
#  define TIMER_SYNC_SYNCWT0_TA        TIMER_SYNC_SYNCWT0(TIMER_SYNC_TA)
#  define TIMER_SYNC_SYNCWT0_TB        TIMER_SYNC_SYNCWT0(TIMER_SYNC_TB)
#  define TIMER_SYNC_SYNCWT0_TATB      TIMER_SYNC_SYNCWT0(TIMER_SYNC_TATB)
#define TIMER_SYNC_SYNCWT1_SHIFT       (14)      /* Synchronize WTM 32/64-Bit wide timer 1 */
#define TIMER_SYNC_SYNCWT1_MASK        (3 << )
#  define TIMER_SYNC_SYNCWT1(n)        ((uint32_t)(n) << TIMER_SYNC_SYNCWT1_SHIFT)
#  define TIMER_SYNC_SYNCWT1_NONE      TIMER_SYNC_SYNCWT1(TIMER_SYNC_NONE)
#  define TIMER_SYNC_SYNCWT1_TA        TIMER_SYNC_SYNCWT1(TIMER_SYNC_TA)
#  define TIMER_SYNC_SYNCWT1_TB        TIMER_SYNC_SYNCWT1(TIMER_SYNC_TB)
#  define TIMER_SYNC_SYNCWT1_TATB      TIMER_SYNC_SYNCWT1(TIMER_SYNC_TATB)
#define TIMER_SYNC_SYNCWT2_SHIFT       (16)      /* Synchronize WTM 32/64-Bit wide timer 2 */
#define TIMER_SYNC_SYNCWT2_MASK        (3 << TIMER_SYNC_SYNCWT2_SHIFT)
#  define TIMER_SYNC_SYNCWT2(n)        ((uint32_t)(n) << TIMER_SYNC_SYNCWT2_SHIFT)
#  define TIMER_SYNC_SYNCWT2_NONE      TIMER_SYNC_SYNCWT2(TIMER_SYNC_NONE)
#  define TIMER_SYNC_SYNCWT2_TA        TIMER_SYNC_SYNCWT2(TIMER_SYNC_TA)
#  define TIMER_SYNC_SYNCWT2_TB        TIMER_SYNC_SYNCWT2(TIMER_SYNC_TB)
#  define TIMER_SYNC_SYNCWT2_TATB      TIMER_SYNC_SYNCWT2(TIMER_SYNC_TATB)
#define TIMER_SYNC_SYNCWT3_SHIFT       (18)      /* Synchronize WTM 32/64-Bit wide timer 3 */
#define TIMER_SYNC_SYNCWT3_MASK        (3 << TIMER_SYNC_SYNCWT3_SHIFT)
#  define TIMER_SYNC_SYNCWT3(n)        ((uint32_t)(n) << TIMER_SYNC_SYNCWT3_SHIFT)
#  define TIMER_SYNC_SYNCWT3_NONE      TIMER_SYNC_SYNCWT3(TIMER_SYNC_NONE)
#  define TIMER_SYNC_SYNCWT3_TA        TIMER_SYNC_SYNCWT3(TIMER_SYNC_TA)
#  define TIMER_SYNC_SYNCWT3_TB        TIMER_SYNC_SYNCWT3(TIMER_SYNC_TB)
#  define TIMER_SYNC_SYNCWT3_TATB      TIMER_SYNC_SYNCWT3(TIMER_SYNC_TATB)
#define TIMER_SYNC_SYNCWT4_SHIFT       (20)      /* Synchronize WTM 32/64-Bit wide timer 4 */
#define TIMER_SYNC_SYNCWT4_MASK        (3 << TIMER_SYNC_SYNCWT4_SHIFT)
#  define TIMER_SYNC_SYNCWT4(n)        ((uint32_t)(n) << TIMER_SYNC_SYNCWT4_SHIFT)
#  define TIMER_SYNC_SYNCWT4_NONE      TIMER_SYNC_SYNCWT4(TIMER_SYNC_NONE)
#  define TIMER_SYNC_SYNCWT4_TA        TIMER_SYNC_SYNCWT4(TIMER_SYNC_TA)
#  define TIMER_SYNC_SYNCWT4_TB        TIMER_SYNC_SYNCWT4(TIMER_SYNC_TB)
#  define TIMER_SYNC_SYNCWT4_TATB      TIMER_SYNC_SYNCWT4(TIMER_SYNC_TATB)
#define TIMER_SYNC_SYNCWT5_SHIFT       (22)      /* Synchronize WTM 32/64-Bit wide timer 5 */
#define TIMER_SYNC_SYNCWT5_MASK        (3 << TIMER_SYNC_SYNCWT5_SHIFT)
#  define TIMER_SYNC_SYNCWT5(n)        ((uint32_t)(n) << TIMER_SYNC_SYNCWT5_SHIFT)
#  define TIMER_SYNC_SYNCWT5_NONE      TIMER_SYNC_SYNCWT5(TIMER_SYNC_NONE)
#  define TIMER_SYNC_SYNCWT5_TA        TIMER_SYNC_SYNCWT5(TIMER_SYNC_TA)
#  define TIMER_SYNC_SYNCWT5_TB        TIMER_SYNC_SYNCWT5(TIMER_SYNC_TB)
#  define TIMER_SYNC_SYNCWT5_TATB      TIMER_SYNC_SYNCWT5(TIMER_SYNC_TATB)

/* Common bit definitions used with:
 *
 * - GPTM Interrupt Mask (IMR)
 * - GPTM Raw Interrupt Status (RIS)
 * - GPTM Masked Interrupt Status (MIS)
 * - GPTM Interrupt Clear (ICR)
 */

