apache/nuttx/arch/arm/src/tiva/hardware/tm4c/tm4c129_timer.h
#define TIMER_INT_TATO                 (1 << 0)  /* Bit 0:  Timer A Time-Out Interrupt */
#define TIMER_INT_CAM                  (1 << 1)  /* Bit 1:  GPTM Timer A Capture Mode Match Interrupt */
#define TIMER_INT_CAE                  (1 << 2)  /* Bit 2:  GPTM Timer A Capture Mode Event Interrupt */
#define TIMER_INT_RTC                  (1 << 3)  /* Bit 3:  GPTM RTC Interrupt */
#define TIMER_INT_TAM                  (1 << 4)  /* Bit 4:  GPTM Timer A Match Interrupt */
#define TIMER_INT_DMAA                 (1 << 5)  /* Bit 5:  GPTM Timer A DMA Done Interrupt */
#define TIMER_INT_TBTO                 (1 << 8)  /* Bit 8:  GPTM Timer B Time-Out Interrupt */
#define TIMER_INT_CBM                  (1 << 9)  /* Bit 9:  GPTM Timer B Capture Mode Match Interrupt */
#define TIMER_INT_CBE                  (1 << 10) /* Bit 10: GPTM Timer B Capture Mode Event Interrupt */
#define TIMER_INT_TBM                  (1 << 11) /* Bit 11: GPTM Timer B Match Interrupt */
#define TIMER_INT_DMAB                 (1 << 13) /* Bit 13: GPTM Timer B DMA Done Interrupt */

#define TIMERA_INTS                    0x0000003f
#define TIMERB_INTS                    0x00002f00
#define TIMER_ALLINTS                  0x00002f3f

/* GPTM Timer A Interval Load (TAILR) (32-bit value) */
/* GPTM Timer B Interval Load (TBILR) (32-bit value) */
/* GPTM Timer A Match (TAMATCHR) (32-bit value) */
/* GPTM Timer B Match (TBMATCHR) (32-bit value) */

/* GPTM Timer A/B Prescale (TnPR) */

#define TIMER_TnPR_TnPSR_SHIFT         (0)       /* Bits 0-8: GPTM Timer A/B Prescale */
#define TIMER_TnPR_TnPSR_MASK          (0xff << TIMER_TnPR_TnPSR_SHIFT)
#  define TIMER_TnPR_TnPSR(n)          ((uint32_t)(n) << TIMER_TnPR_TnPSR_SHIFT)

/* GPTM Timer A/B Prescale Match (TnPMR) */

#define TIMER_TnPMR_TnPSMR_SHIFT       (0)       /* Bits 0-8:  GPTM Timer A/B Prescale Match */
#define TIMER_TnPMR_TnPSMR_MASK        (0xff << TIMER_TnPMR_TnPSMR_SHIFT)
#  define TIMER_TnPMR_TnPSMR(n)        ((uint32_t)(n) << TIMER_TnPMR_TnPSMR_SHIFT)

/* GPTM Timer A (TAR) (16/32-bit value) */
/* GPTM Timer B (TBR) (16/32-bit value) */
/* GPTM Timer A Value (TAV) (16/32-bit value) */
/* GPTM Timer B Value (TBV) (16/32-bit value) */

/* GPTM RTC Predivide (RTCPD) */

#define TIMER_RTCPD_SHIFT              (0)       /* Bits 0-15: RTC Predivide Counter Value */
#define TIMER_RTCPD_MASK               (0xffff << TIMER_RTCPD_SHIFT)
#  define TIMER_RTCPD(n)               ((uint32_t)(n) << TIMER_RTCPD_SHIFT)

/* GPTM Timer A/B Prescale Snapshot (TnPS) */

#define TIMER_TnPS_PSS_SHIFT           (0)       /* Bits 0-15: GPTM Timer A/B Prescaler Snapshot */
#define TIMER_TnPS_PSS_MASK            (0xffff << TIMER_TnPS_PSS_SHIFT)
#  define TIMER_TnPS_PSS(n)            ((uint32_t)(n) << TIMER_TnPS_PSS_SHIFT)

/* GPTM Timer A/B Prescale Value (TnPV) */

#define TIMER_TnPV_PSS_SHIFT           (0)       /* Bits 0-15: GPTM Timer A/B Prescaler Value */
#define TIMER_TnPS_PSS_MASK            (0xffff << TIMER_TnPS_PSS_SHIFT)
#  define TIMER_TnPS_PSS(n)            ((uint32_t)(n) << TIMER_TnPS_PSS_SHIFT)

/* GPTM DMA Event (DMAEV) */

#define TIMER_DMAEV_TATODMAEN          (1 << 0)  /* Bit 0:  GPTM A Time-Out Event DMA Trigger Enable */
#define TIMER_DMAEV_CAMDMAEN           (1 << 1)  /* Bit 1:  GPTM A Capture Match Event DMA Trigger Enable */
#define TIMER_DMAEV_CAEDMAEN           (1 << 2)  /* Bit 2:  GPTM A Capture Event DMA Trigger Enable */
#define TIMER_DMAEV_RTCDMAEN           (1 << 3)  /* Bit 3:  GPTM A RTC Match Event DMA Trigger Enable */
#define TIMER_DMAEV_TAMDMAEN           (1 << 4)  /* Bit 4:  GPTM A Mode Match Event DMA Trigger Enable */
#define TIMER_DMAEV_TBTODMAEN          (1 << 8)  /* Bit 8:  GPTM B Time-Out Event DMA Trigger Enable */
#define TIMER_DMAEV_CBMDMAEN           (1 << 9)  /* Bit 9:  GPTM B Capture Match Event DMA Trigger Enable */
#define TIMER_DMAEV_CBEDMAEN           (1 << 10) /* Bit 10: GPTM B Capture Event DMA Trigger Enable */
#define TIMER_DMAEV_TBMDMAEN           (1 << 11) /* Bit 11: GPTM B Mode Match Event DMA Trigger Enable */

/* GPTM ADC Event (ADCEV) */

#define TIMER_ADCEV_TATOADCEN          (1 << 0)  /* Bit 0:  GPTM A Time-Out Event ADC Trigger Enable */
#define TIMER_ADCEV_CAMADCEN           (1 << 1)  /* Bit 1:  GPTM A Capture Match Event ADC Trigger Enable */
#define TIMER_ADCEV_CAEADCEN           (1 << 2)  /* Bit 2:  GPTM A Capture Event ADC Trigger Enable */
#define TIMER_ADCEV_RTCADCEN           (1 << 3)  /* Bit 3:  GPTM RTC Match Event ADC Trigger Enable */
#define TIMER_ADCEV_TAMADCEN           (1 << 4)  /* Bit 4:  GPTM A Mode Match Event ADC Trigger Enable */
#define TIMER_ADCEV_TBTOADCEN          (1 << 8)  /* Bit 8:  GPTM B Time-Out Event ADC Trigger Enable */
#define TIMER_ADCEV_CBMADCEN           (1 << 9)  /* Bit 9:  GPTM B Capture Match Event ADC Trigger Enable */
#define TIMER_ADCEV_CBEADCEN           (1 << 10) /* Bit 10: GPTM B Capture Event ADC Trigger Enable */
#define TIMER_ADCEV_TBMADCEN           (1 << 11) /* Bit 11: GPTM B Mode Match Event ADC Trigger Enable */

/* GPTM Peripheral Properties (PP) */

#define TIMER_PP_SIZE_SHIFT            (0)       /* Bits 0-3: Count Size */
#define TIMER_PP_SIZE_MASK             (15 << TIMER_PP_SIZE_SHIFT)
#  define TIMER_PP_SIZE_16             (0 << TIMER_PP_SIZE_SHIFT) /* Timer A/B 16 bits with 8-bit prescale */
#  define TIMER_PP_SIZE_32             (1 << TIMER_PP_SIZE_SHIFT) /* Timer A/B 32 bits with 16-bit prescale */
#define TIMER_PP_CHAIN                 (1 << 4)  /* Bit 4:  Chain with Other Timers */
#define TIMER_PP_SYNCCNT               (1 << 5)  /* Bit 5:  Synchronize Start */
#define TIMER_PP_ALTCLK                (1 << 6)  /* Bit 6:  Alternate Clock Source */

/* GPTM Clock Configuration */

#define TIMER_CC_ALTCLK                (1 << 0)  /* Bit 0: Alternate Clock Source */

#endif /* __ARCH_ARM_SRC_TIVA_HARDWARE_LM_TM4C129_TIMER_H */
